# Да се състави програма, чрез която се въвежда 4-цифренo естествено число от
# интервала [1000.. 9999]. От това число се формират 2 нови 2-цифрени числа. Първото
# число се формира от 1-та и 4-та цифра на въведеното число. Второто число се формира
# от 2-рa - 3-та цифра на въведеното число. На екрана да се изведе дали 1-то ново число
# e по-малко <, равно = или по-голямо от 2-то число.
# Използвайте проверка на логическо условие - оператор if.
# Пример: 3332 Изход: по-малко (32<33)
# Пример: 1144 Изход: равни (14=14)
# Пример: 9875 Изход: по-голямо (95>87)

#### user input
### varinant1 -> dificult
# x=int(input('Въведете 4-цифренo естествено число в интервала [1000.. 9999]: '))

# x = 9875
# # a = int(x/1000)
# a = x//1000
# b = (x%1000)//100
# print(a)
# print(b)

# print('abc'[0])
# print('abc'[1])
# print('abc'[2])

x=input('Въведете 4-цифренo естествено число в интервала [1000.. 9999]: ')

#### get digits
a1 = x[0]
a2 = x[1]
a3 = x[2]
a4 = x[3]

#### create the two numbers:
first_num = int(a1+a4)
second_num = int(a2+a3)
print(first_num, second_num)

#### check which is bigger:
# Пример: 3332 Изход: по-малко (32<33)
# Пример: 1144 Изход: равни (14=14)
# Пример: 9875 Изход: по-голямо (95>87)

if first_num > second_num:
	print(f'по-голямо ({first_num}>{second_num})')
elif first_num == second_num:
	print(f'равни ({first_num}={second_num})')
else:
	print(f'по-малко ({first_num} < {second_num})')




